package day1;

/**
 * @author Neil Alishev
 * @student Nikita Starkov
 *
 * Вывести на экран слово “JAVA”, в столбик, чтобы оно повторилось 10 раз, используя цикл на ваше усмотрение
 * (for или while).
 */

public class Task3 {
    public static void main(String[] args) {
        int i = 0;
        while (i < 10) {
            System.out.println("JAVA");
            i++;
        }
    }
}